---
kind: method
id: M:Autodesk.Revit.DB.PolymeshTopology.GetFacets
source: html/6225dc0b-0764-5682-0acd-200b1feb19d4.htm
---
# Autodesk.Revit.DB.PolymeshTopology.GetFacets Method

Returns a definitions of all facets of the polymesh

## Syntax (C#)
```csharp
public IList<PolymeshFacet> GetFacets()
```

## Returns
An array of PolymeshFacet instances, each of which represents
 one facet defined by 3 vertices of the polymesh.